<template>
  <div>
    <el-tabs v-model="activeName" @tab-click="handleClick">
      <el-tab-pane label="大二上实验说明" name="first">
        <div class="article">
          <h2>暂未更新</h2>
        </div>
      </el-tab-pane>
      <el-tab-pane label="大二下实验说明" name="second">
        <div class="article">
          <h2>2021 年春季学期“基础物理实验”课程说明</h2>
          <ul>
            <li>
              本学期物理实验从第2周星期一（2021年3月8日）开始，选课从2021年3月3日（星期三）开始。
            </li>
            <li>
              网上选课方法与上学期相同，沙河校区选课网址：<a href="http://115.25.136.17:8000">http://115.25.136.17:8000</a> ,
              学院路校区选课网址： <a href="http://115.25.136.17:9000">http://115.25.136.17:9000</a>，禁止跨校区选课。<br>
              本学期不需要重新注册，进入北航物理实验选课网主页后，只要输入学号和密码，点击“登录”即可进行选课。新注册的学生（含重修生）请输入学号和初始密码 666666 进行登录，然后点击“个人信息”修改密码并完善个人资料（请务必修改初始密码并注意保密，否则选课
              记录被修改由个人负责）。若遗忘密码或需加课等，沙河校区请到实 3-414（周一上午、周四上午下午工作时段），学院路校区到十三号公寓地下一层 B1-45A（两校区，轮流安排）找管理员老师安排（或者联系邮
              箱 kroma_cn@126.com）。
            </li>
            <li>
              跟上学期一样，学生对教务课表规定时段内开放的实验课享有优先选择权，若该时段优先选课期已过，该时段仍有空位，将适时对全校未选上课的同学开放。课前第三天自动关闭选课；选课人数小于等于5位同学的实验不开课。英文实验对全校学生开放，同学们可以在教务课表规定时段选做中文实验或在英文课时段选做英文实验。
            </li>
            <li>
              实验课程中的困难和问题反馈方式：有关所选实验的问题请联系对应时段的授课教师，邮箱地址请在选课网站查询；如果三个工作日仍旧未能解决，或学习过程中遇到的困难课程建议反馈等，请联系邮箱phylab_buaa@163.com，课程组会在工作日尽快予以处理。（如果是有关所选实验的问题，邮件名称里注明：基础物理实验+第X周星期X+实验名称+姓名学号）
            </li>
            <li>
              本学期分为综合性实验和设计性（考试）实验两部分。综合性实验时间为第 2~12 周，具体实验代号和实验题目见后面附表；设计性（考试）实验时间为第 14~16 周，具体选课办法请届时关注物理实验中心网站通知。
            </li>
            <li>
              本学期不再设置积分门槛，最终成绩由总评成绩评定，总评不及格，需明年重修。总评成绩=(综合性实验平均成绩*20*50％+考试实验成绩*40％)*所获总积分/30+实验拓展成绩(10％)<br>
              ①.总积分大于33积分，以33积分计算成绩；总评超过100分，以100分计算。<br>
              ②.单个综合性实验成绩=(实验操作成绩+实验报告成绩)/2<br>
              ③.考试实验成绩=考试实验总成绩(2次考试操作成绩+2次考试实验报告成绩)/4。<br>
              ④.考虑到各个老师对评分标准掌握不一，计算总评分时将对平时实验成绩分别按老师进行标准化处理。
            </li>
            <li>
              选好课程后，请跟上学期相同，参照学校云《中国大学MOOC学校云本校认证学生-使用手册》，选择《基础物理实验》SPOC，并请关联经常使用的邮箱地址，以方便及时接收到课程组关于本实验的通知公告。同时加入教务系统课表对应时段的慕课堂，比如排课时段在周一下午的，进入周一下午（学院路）课堂。
            </li>
            <li>
              实验课程均要求课前预习。课前在慕课平台学习所选实验的慕课，并完成慕课测试。根据学习心得撰写不超过 A4 纸张一面的预习报告，上课前请出示慕课学习记录、完成慕课测试的记录、以及预习报告，方可进行接下来的实验。
            </li>
            <li>
              关于英文授课：英文课程的讲解和辅导过程全部用英文，学生要课前写好英文预习报告（参考英文论文格式），课堂上完成实验操作、数据记录，还要当堂完成数据处理，课后要提交该实验的英文论文（可替代本学期的研究性报告）。英文授课教师拥有 5 个奖励积分权力，根据学生完成的情况适当给予。
            </li>
            <li>
              请在一周内将数据处理报告交到相应报告老师的邮箱（邮件和报告名称请参照：第X周周X+实验题目+姓名），超过两周未交报告，原则上不再予以批改，该次报告成绩记“零”分。各次实验的成绩，四周后可到网上查询，若有漏缺请及时与该实验的任课教师联系。
            </li>
            <li>
              实验拓展跟上学期一样，分为两种方式，可根据自己的能力选择其中一种。<br>
              ①.虚拟仿真实验设计。可针对所开设的物理实验整体、或物理实验中的某些元器件、或物理理论课程中的物理实验进行虚拟仿真实验设计。以课题组为单位进行，每课题组最多不能超过 6 人，每人只能参加一个课题组。在提交说明里需要注明每人的实际贡献。设计软件建议用 Visual C#，最终需要提交.exe文件，源代码文件，说明文件。<br>
              ②.研究性报告。在所开出实验的基础上，对某些现象或问题进行研究、分析后撰写学术论文。研究性报告每课题组最多不能超过 2 人，每人只能参加一个课题组。研究性报告内容包括：摘要（小于 200 字）、实验原理、实验仪器、主要步骤、数据记录与处理、讨论等。书写格式可参照《大学物理》、《物理实验》等杂志要求。研究性报告可任选一个实验撰写，报告最后要附上带老师签字的原始数据照片，但报告中的数据要重新列表、处理，不得写“见原始数据记录”。实验拓展部分由第一作者通过物理实验选课网提交（提交后一定要进行查询以确认提交成功，其他作者也要查询）；提交的时间不能超过第 14 周，若有特殊原因需要延期提交，需向实验中心提出书面申请，说明延期理由及延长的期限，获批后方可实行。严禁抄袭，后交报告或程序中若发现雷同,该部分不予计分（从网上直接下载也属抄袭！）；若全部雷同，则后交组记为零分。
            </li>
          </ul>
          <p>
            注意事项：<br>
            1．选课后无故不来做实验将扣除 2 个积分。因病缺课者，凭医院证明找选课管理教师消除记录（一周内）；其它原因缺课于课前凭校（院）教务科证明消除记录。其它积分扣除原则同上学期。<br>
            2．上课时间：上午 8:50—11:50，下午 14:00—17:00，晚上 18:30—21:30
          </p>
        </div>
        <img src="../../assets/img/2-1.png" class="img">
        <img src="../../assets/img/2-2.png" class="img">
      </el-tab-pane>
    </el-tabs>
  </div>
</template>

<script>
export default {
  name: "Introduction",
  data() {
    return {
      activeName: 'first',
    };
  },
  methods: {
    handleClick(tab, event) {
      console.log(tab, event);
    }
  }
}
</script>

<style scoped>
.article {
  display: flex;
  flex-direction: column;
  margin: 0 auto;
  font-size: 16px;
  max-width: 70vw;
  line-height: 40px;
}

.img {
  display: flex;
  margin: 0 auto;
}

>>>.el-tabs--top {
  padding-left: 20px;
}
</style>
